import mysql.connector
# DB 접속
conn = None
cur = None
sql = ""
conn = mysql.connector.connect(host='sarte.kr', user='root', password='1234', db='food', charset='utf8')

cursor = conn.cursor(prepared=True)
sql = "INSERT INTO week (week_type, week_no, food_1, food_2, food_3, food_4, food_5, food_6) VALUES (?,?,?,?,?,?,?,?)"
# INSERT INTO `food`.`week` VALUES ('36', '2', '17', '잡곡밥', '미역국', '오징어볶음', '고구마맛탕', '흑임자샐러드', '둥글레차');
val = [
    (8, 11,  '쌀밥', '고추장찌개', '달걀말이', '견과류멸치볶음', '깻순나물', '바나나'),
    (8, 12,  '잡곡밥', '육개장', '마늘쫑잔멸치볶음', '오징어야채무침', '흑임자샐러드', '플레인요거트'),
    (8, 13,  '잡곡밥', '달걀국', '닭갈비', '청포묵양념', '햄감자채볶음', '매실차'),
    (8, 14,  '기장밥', '미소된장국', '소불고기/쌈', '청포묵양념', '콩나물무침', '오미자차'),
    (8, 10, '기장밥', '미니짬뽕', '돈육떡볶음', '춘권', '참나물무침', '요구르트'),
    (8, 15, '잡곡밥', '얼갈이된장국', '돈육떡볶음', '고구마맛탕', '배추김치', '둥글레차'),
    (8, 16, '쌀밥', '황태해장국', '카레소스', '단호박튀김', '배추김치', '경단'),
    (8, 17, '잡곡밥', '어묵국', '갈치구이', '햄감자채볶음', '물파래무침', '매실차'),
    (8, 18, '잡곡밥', '미역국', '오리지날윙', '고구마맛탕', '흑임자샐러드', '둥글레차'),
]

cursor.executemany(sql, val)

conn.commit()
